GopalSaraf/Practicals/PSDL/include/proc/pic16f570.inc
// Register: ADRES
#define ADRES ADRES
ADRES                                    equ 000Ah
// bitfield definitions
ADRES_ADRES_POSN                         equ 0000h
ADRES_ADRES_POSITION                     equ 0000h
ADRES_ADRES_SIZE                         equ 0008h
ADRES_ADRES_LENGTH                       equ 0008h
ADRES_ADRES_MASK                         equ 00FFh
ADRES_ADRES0_POSN                        equ 0000h
ADRES_ADRES0_POSITION                    equ 0000h
ADRES_ADRES0_SIZE                        equ 0001h
ADRES_ADRES0_LENGTH                      equ 0001h
ADRES_ADRES0_MASK                        equ 0001h
ADRES_ADRES1_POSN                        equ 0001h
ADRES_ADRES1_POSITION                    equ 0001h
ADRES_ADRES1_SIZE                        equ 0001h
ADRES_ADRES1_LENGTH                      equ 0001h
ADRES_ADRES1_MASK                        equ 0002h
ADRES_ADRES2_POSN                        equ 0002h
ADRES_ADRES2_POSITION                    equ 0002h
ADRES_ADRES2_SIZE                        equ 0001h
ADRES_ADRES2_LENGTH                      equ 0001h
ADRES_ADRES2_MASK                        equ 0004h
ADRES_ADRES3_POSN                        equ 0003h
ADRES_ADRES3_POSITION                    equ 0003h
ADRES_ADRES3_SIZE                        equ 0001h
ADRES_ADRES3_LENGTH                      equ 0001h
ADRES_ADRES3_MASK                        equ 0008h
ADRES_ADRES4_POSN                        equ 0004h
ADRES_ADRES4_POSITION                    equ 0004h
ADRES_ADRES4_SIZE                        equ 0001h
ADRES_ADRES4_LENGTH                      equ 0001h
ADRES_ADRES4_MASK                        equ 0010h
ADRES_ADRES5_POSN                        equ 0005h
ADRES_ADRES5_POSITION                    equ 0005h
ADRES_ADRES5_SIZE                        equ 0001h
ADRES_ADRES5_LENGTH                      equ 0001h
ADRES_ADRES5_MASK                        equ 0020h
ADRES_ADRES6_POSN                        equ 0006h
ADRES_ADRES6_POSITION                    equ 0006h
ADRES_ADRES6_SIZE                        equ 0001h
ADRES_ADRES6_LENGTH                      equ 0001h
ADRES_ADRES6_MASK                        equ 0040h
ADRES_ADRES7_POSN                        equ 0007h
ADRES_ADRES7_POSITION                    equ 0007h
ADRES_ADRES7_SIZE                        equ 0001h
ADRES_ADRES7_LENGTH                      equ 0001h
ADRES_ADRES7_MASK                        equ 0080h

// Register: INTCON0
#define INTCON0 INTCON0
INTCON0                                  equ 000Bh
// bitfield definitions
INTCON0_GIE_POSN                         equ 0000h
INTCON0_GIE_POSITION                     equ 0000h
INTCON0_GIE_SIZE                         equ 0001h
INTCON0_GIE_LENGTH                       equ 0001h
INTCON0_GIE_MASK                         equ 0001h
INTCON0_RBIF_POSN                        equ 0004h
INTCON0_RBIF_POSITION                    equ 0004h
INTCON0_RBIF_SIZE                        equ 0001h
INTCON0_RBIF_LENGTH                      equ 0001h
INTCON0_RBIF_MASK                        equ 0010h
INTCON0_T0IF_POSN                        equ 0005h
INTCON0_T0IF_POSITION                    equ 0005h
INTCON0_T0IF_SIZE                        equ 0001h
INTCON0_T0IF_LENGTH                      equ 0001h
INTCON0_T0IF_MASK                        equ 0020h
INTCON0_CWIF_POSN                        equ 0006h
INTCON0_CWIF_POSITION                    equ 0006h
INTCON0_CWIF_SIZE                        equ 0001h
INTCON0_CWIF_LENGTH                      equ 0001h
INTCON0_CWIF_MASK                        equ 0040h
INTCON0_ADIF_POSN                        equ 0007h
INTCON0_ADIF_POSITION                    equ 0007h
INTCON0_ADIF_SIZE                        equ 0001h
INTCON0_ADIF_LENGTH                      equ 0001h
INTCON0_ADIF_MASK                        equ 0080h

// Register: EECON
#define EECON EECON
EECON                                    equ 0021h
// bitfield definitions
EECON_RD_POSN                            equ 0000h
EECON_RD_POSITION                        equ 0000h
EECON_RD_SIZE                            equ 0001h
EECON_RD_LENGTH                          equ 0001h
EECON_RD_MASK                            equ 0001h
EECON_WR_POSN                            equ 0001h
EECON_WR_POSITION                        equ 0001h
EECON_WR_SIZE                            equ 0001h
EECON_WR_LENGTH                          equ 0001h
EECON_WR_MASK                            equ 0002h
EECON_WREN_POSN                          equ 0002h
EECON_WREN_POSITION                      equ 0002h
EECON_WREN_SIZE                          equ 0001h
EECON_WREN_LENGTH                        equ 0001h
EECON_WREN_MASK                          equ 0004h
EECON_WRERR_POSN                         equ 0003h
EECON_WRERR_POSITION                     equ 0003h
EECON_WRERR_SIZE                         equ 0001h
EECON_WRERR_LENGTH                       equ 0001h
EECON_WRERR_MASK                         equ 0008h
EECON_FREE_POSN                          equ 0004h
EECON_FREE_POSITION                      equ 0004h
EECON_FREE_SIZE                          equ 0001h
EECON_FREE_LENGTH                        equ 0001h
EECON_FREE_MASK                          equ 0010h

// Register: EEDATA
#define EEDATA EEDATA
EEDATA                                   equ 0025h
// bitfield definitions
EEDATA_EEDATA_POSN                       equ 0000h
EEDATA_EEDATA_POSITION                   equ 0000h
EEDATA_EEDATA_SIZE                       equ 0008h
EEDATA_EEDATA_LENGTH                     equ 0008h
EEDATA_EEDATA_MASK                       equ 00FFh

// Register: EEADR
#define EEADR EEADR
EEADR                                    equ 0026h
// bitfield definitions
EEADR_EEADR_POSN                         equ 0000h
EEADR_EEADR_POSITION                     equ 0000h
EEADR_EEADR_SIZE                         equ 0006h
EEADR_EEADR_LENGTH                       equ 0006h
EEADR_EEADR_MASK                         equ 003Fh

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 0027h
// bitfield definitions
CM1CON0_nC1WU_POSN                       equ 0000h
CM1CON0_nC1WU_POSITION                   equ 0000h
CM1CON0_nC1WU_SIZE                       equ 0001h
CM1CON0_nC1WU_LENGTH                     equ 0001h
CM1CON0_nC1WU_MASK                       equ 0001h
CM1CON0_C1PREF_POSN                      equ 0001h
CM1CON0_C1PREF_POSITION                  equ 0001h
CM1CON0_C1PREF_SIZE                      equ 0001h
CM1CON0_C1PREF_LENGTH                    equ 0001h
CM1CON0_C1PREF_MASK                      equ 0002h
CM1CON0_C1NREF_POSN                      equ 0002h
CM1CON0_C1NREF_POSITION                  equ 0002h
CM1CON0_C1NREF_SIZE                      equ 0001h
CM1CON0_C1NREF_LENGTH                    equ 0001h
CM1CON0_C1NREF_MASK                      equ 0004h
CM1CON0_C1ON_POSN                        equ 0003h
CM1CON0_C1ON_POSITION                    equ 0003h
CM1CON0_C1ON_SIZE                        equ 0001h
CM1CON0_C1ON_LENGTH                      equ 0001h
CM1CON0_C1ON_MASK                        equ 0008h
CM1CON0_nC1T0CS_POSN                     equ 0004h
CM1CON0_nC1T0CS_POSITION                 equ 0004h
CM1CON0_nC1T0CS_SIZE                     equ 0001h
CM1CON0_nC1T0CS_LENGTH                   equ 0001h
CM1CON0_nC1T0CS_MASK                     equ 0010h
CM1CON0_C1POL_POSN                       equ 0005h
CM1CON0_C1POL_POSITION                   equ 0005h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0020h
CM1CON0_nC1OUTEN_POSN                    equ 0006h
CM1CON0_nC1OUTEN_POSITION                equ 0006h
CM1CON0_nC1OUTEN_SIZE                    equ 0001h
CM1CON0_nC1OUTEN_LENGTH                  equ 0001h
CM1CON0_nC1OUTEN_MASK                    equ 0040h
CM1CON0_C1OUT_POSN                       equ 0007h
CM1CON0_C1OUT_POSITION                   equ 0007h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0080h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 0028h
// bitfield definitions
CM2CON0_nC2WU_POSN                       equ 0000h
CM2CON0_nC2WU_POSITION                   equ 0000h
CM2CON0_nC2WU_SIZE                       equ 0001h
CM2CON0_nC2WU_LENGTH                     equ 0001h
CM2CON0_nC2WU_MASK                       equ 0001h
CM2CON0_C2PREF1_POSN                     equ 0001h
CM2CON0_C2PREF1_POSITION                 equ 0001h
CM2CON0_C2PREF1_SIZE                     equ 0001h
CM2CON0_C2PREF1_LENGTH                   equ 0001h
CM2CON0_C2PREF1_MASK                     equ 0002h
CM2CON0_C2NREF_POSN                      equ 0002h
CM2CON0_C2NREF_POSITION                  equ 0002h
CM2CON0_C2NREF_SIZE                      equ 0001h
CM2CON0_C2NREF_LENGTH                    equ 0001h
CM2CON0_C2NREF_MASK                      equ 0004h
CM2CON0_C2ON_POSN                        equ 0003h
CM2CON0_C2ON_POSITION                    equ 0003h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0008h
CM2CON0_C2PREF2_POSN                     equ 0004h
CM2CON0_C2PREF2_POSITION                 equ 0004h
CM2CON0_C2PREF2_SIZE                     equ 0001h
CM2CON0_C2PREF2_LENGTH                   equ 0001h
CM2CON0_C2PREF2_MASK                     equ 0010h
CM2CON0_C2POL_POSN                       equ 0005h
CM2CON0_C2POL_POSITION                   equ 0005h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0020h
CM2CON0_nC2OUTEN_POSN                    equ 0006h
CM2CON0_nC2OUTEN_POSITION                equ 0006h
CM2CON0_nC2OUTEN_SIZE                    equ 0001h
CM2CON0_nC2OUTEN_LENGTH                  equ 0001h
CM2CON0_nC2OUTEN_MASK                    equ 0040h
CM2CON0_C2OUT_POSN                       equ 0007h
CM2CON0_C2OUT_POSITION                   equ 0007h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0080h

// Register: VRCON
#define VRCON VRCON
VRCON                                    equ 0029h
// bitfield definitions
VRCON_VR_POSN                            equ 0000h
VRCON_VR_POSITION                        equ 0000h
VRCON_VR_SIZE                            equ 0004h
VRCON_VR_LENGTH                          equ 0004h
VRCON_VR_MASK                            equ 000Fh
VRCON_VRR_POSN                           equ 0004h
VRCON_VRR_POSITION                       equ 0004h
VRCON_VRR_SIZE                           equ 0001h
VRCON_VRR_LENGTH                         equ 0001h
VRCON_VRR_MASK                           equ 0010h
VRCON_VROE2_POSN                         equ 0005h
VRCON_VROE2_POSITION                     equ 0005h
VRCON_VROE2_SIZE                         equ 0001h
VRCON_VROE2_LENGTH                       equ 0001h
VRCON_VROE2_MASK                         equ 0020h
VRCON_VROE1_POSN                         equ 0006h
VRCON_VROE1_POSITION                     equ 0006h
VRCON_VROE1_SIZE                         equ 0001h
VRCON_VROE1_LENGTH                       equ 0001h
VRCON_VROE1_MASK                         equ 0040h
VRCON_VREN_POSN                          equ 0007h
VRCON_VREN_POSITION                      equ 0007h
VRCON_VREN_SIZE                          equ 0001h
VRCON_VREN_LENGTH                        equ 0001h
VRCON_VREN_MASK                          equ 0080h
VRCON_VR0_POSN                           equ 0000h
VRCON_VR0_POSITION                       equ 0000h
VRCON_VR0_SIZE                           equ 0001h
VRCON_VR0_LENGTH                         equ 0001h
VRCON_VR0_MASK                           equ 0001h
VRCON_VR1_POSN                           equ 0001h
VRCON_VR1_POSITION                       equ 0001h
VRCON_VR1_SIZE                           equ 0001h
VRCON_VR1_LENGTH                         equ 0001h
VRCON_VR1_MASK                           equ 0002h
VRCON_VR2_POSN                           equ 0002h
VRCON_VR2_POSITION                       equ 0002h
VRCON_VR2_SIZE                           equ 0001h
VRCON_VR2_LENGTH                         equ 0001h
VRCON_VR2_MASK                           equ 0004h
VRCON_VR3_POSN                           equ 0003h
VRCON_VR3_POSITION                       equ 0003h
VRCON_VR3_SIZE                           equ 0001h
VRCON_VR3_LENGTH                         equ 0001h
VRCON_VR3_MASK                           equ 0008h

// Register: ANSEL
#define ANSEL ANSEL
ANSEL                                    equ 002Ah
// bitfield definitions
ANSEL_ANS0_POSN                          equ 0000h
ANSEL_ANS0_POSITION                      equ 0000h
ANSEL_ANS0_SIZE                          equ 0001h
ANSEL_ANS0_LENGTH                        equ 0001h
ANSEL_ANS0_MASK                          equ 0001h
ANSEL_ANS1_POSN                          equ 0001h
ANSEL_ANS1_POSITION                      equ 0001h
ANSEL_ANS1_SIZE                          equ 0001h
ANSEL_ANS1_LENGTH                        equ 0001h
ANSEL_ANS1_MASK                          equ 0002h
ANSEL_ANS2_POSN                          equ 0002h
ANSEL_ANS2_POSITION                      equ 0002h
ANSEL_ANS2_SIZE                          equ 0001h
ANSEL_ANS2_LENGTH                        equ 0001h
ANSEL_ANS2_MASK                          equ 0004h
ANSEL_ANS3_POSN                          equ 0003h
ANSEL_ANS3_POSITION                      equ 0003h
ANSEL_ANS3_SIZE                          equ 0001h
ANSEL_ANS3_LENGTH                        equ 0001h
ANSEL_ANS3_MASK                          equ 0008h
ANSEL_ANS4_POSN                          equ 0004h
ANSEL_ANS4_POSITION                      equ 0004h
ANSEL_ANS4_SIZE                          equ 0001h
ANSEL_ANS4_LENGTH                        equ 0001h
ANSEL_ANS4_MASK                          equ 0010h
ANSEL_ANS5_POSN                          equ 0005h
ANSEL_ANS5_POSITION                      equ 0005h
ANSEL_ANS5_SIZE                          equ 0001h
ANSEL_ANS5_LENGTH                        equ 0001h
ANSEL_ANS5_MASK                          equ 0020h
ANSEL_ANS6_POSN                          equ 0006h
ANSEL_ANS6_POSITION                      equ 0006h
ANSEL_ANS6_SIZE                          equ 0001h
ANSEL_ANS6_LENGTH                        equ 0001h
ANSEL_ANS6_MASK                          equ 0040h
ANSEL_ANS7_POSN                          equ 0007h
ANSEL_ANS7_POSITION                      equ 0007h
ANSEL_ANS7_SIZE                          equ 0001h
ANSEL_ANS7_LENGTH                        equ 0001h
ANSEL_ANS7_MASK                          equ 0080h

// Register: IW
#define IW IW
IW                                       equ 0061h
// bitfield definitions
IW_IWREG_POSN                            equ 0000h
IW_IWREG_POSITION                        equ 0000h
IW_IWREG_SIZE                            equ 0008h
IW_IWREG_LENGTH                          equ 0008h
IW_IWREG_MASK                            equ 00FFh

